PEMILIHAN BARIS (ROW SELECTION) PADA DATA FRAME

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.4.1
1.22.2

PERSIAPAN DATA FRAME

In [4]:
n_rows = 10
n_cols = 5
cols = tuple("ABCDE")

df = pd.DataFrame(np.random.randint(1, 10, size = (n_rows, n_cols)), columns = cols)

df

   A  B  C  D  E
0  4  2  9  5  2
1  8  2  6  6  7
2  1  3  4  2  1
3  8  3  2  9  1
4  6  6  3  3  4
5  6  5  3  7  7
6  5  8  7  7  1
7  9  5  3  6  6
8  1  9  8  4  4
9  6  8  9  7  3

SELECTION DENGAN OPERATOR LOGIKA OR (|)

In [6]:
df[(df["A"] == 1) | (df["A"] == 3)]

   A  B  C  D  E
2  1  3  4  2  1
8  1  9  8  4  4

SELECTION DENGAN FUNGSI isin()

In [7]:
df[df["A"].isin([1, 3])]

   A  B  C  D  E
2  1  3  4  2  1
8  1  9  8  4  4

MENGENAL OPERASI NEGASI ~, YAITU KEBALIKAN DARI OPERATOR OR (|) ATAU isin()

In [8]:
df[~df["A"].isin([1, 3])]

   A  B  C  D  E
0  4  2  9  5  2
1  8  2  6  6  7
3  8  3  2  9  1
4  6  6  3  3  4
5  6  5  3  7  7
6  5  8  7  7  1
7  9  5  3  6  6
9  6  8  9  7  3